<template>
  <section class="py-16 border-b border-b-secondary/10">
    <div>
      <div class="mx-auto max-w-3xl space-y-6">
        <UiHeading level="2" size="3xl" class="font-bold">Наша история</UiHeading>
        <div class="space-y-4 text-muted-foreground">
          <UiText>
            Компания HexaEnd была основана в 2023 году командой инженеров-программистов, которые были разочарованы
            существующими инструментами управления проектами. Мы считали, что управление проектами должно быть
            интуитивно понятным, гибким и действительно помогать командам создавать лучшее программное обеспечение.
          </UiText>
          <UiText>
            То, что начиналось как побочный проект, быстро набрало обороты, когда команды по всему миру узнали о нашем
            уникальном подходе к гибкому управлению проектами. Сегодня HexaEnd используют тысячи команд в различных
            отраслях.
          </UiText>
          <UiText>
            Наша миссия проста: помогать командам создавать лучшие продукты благодаря эффективной совместной работе и
            оптимизированным рабочим процессам. Мы стремимся к постоянному совершенствованию и инновациям, как и
            команды, которым мы помогаем.
          </UiText>
        </div>
      </div>
    </div>
  </section>
</template>